//=======================================================
// ファイル名	: defaultPS.hlsl
// 制作者		: 大槻 海斗(Sand)
// 制作日		: 2025/12/04
// 更新日		: 2025/12/04
// 概要			: デフォルトピクセルシェーダー
//=======================================================

//=======================================================
// インクルード
//=======================================================
#include "common.hlsli" 

// ピクセルシェーダーメイン関数
void PSMain(in VS_OUT In, out float4 outDiffuse : SV_Target)
{
    //入力されたピクセル色をそのまま出力
    outDiffuse = In.color;
     
}