//=======================================================
// ファイル名	: Config.h
// 制作者		: 大槻 海斗(Sand)
// 制作日		: 2025/12/10
// 更新日		: 2025/12/10
// 詳細			: 各種設定ファイル
//=======================================================
#pragma once
//=======================================================
// インクルード
//=======================================================
#include <string>

/// <summary>
/// アプリケーションの設定を格納する構造体
/// </summary>
/// <remarks>
/// この構造体は、アプリケーションの起動時に使用される各種設定を格納します。
/// </remarks>
struct Config
{
    bool fullscreen;
    int  width;
    int  height;
    std::string title;
};