//=======================================================
// ファイル名	: Debug.h
// 制作者		: 大槻 海斗(Sand)
// 制作日		: 2025/11/17
// 詳細			: デバッグ関連の関数をまとめたクラスのヘッダーファイル
//=======================================================
#pragma once
//=======================================================
// インクルード
//=======================================================
#include <Windows.h>	// Windows API
#include <string>       // std::wstring

/// <summary>
/// デバッグ関連の関数をまとめたクラス
/// </summary>
/// <remarks>
/// デバッグビルド時にのみ有効なデバッグ用関数を提供するクラス
/// </remarks>
class Debug
{
public:

	// HRESULTのチェック関数
	static bool CheckHR(HRESULT hr, const std::wstring& title = L"HRESULT エラー");

};