//=======================================================
// ファイル名	: MeshRenderer.h
// 制作者		: 大槻 海斗(Sand)
// 制作日		: 2025/11/20
// 詳細			: メッシュレンダラーのヘッダファイル
//=======================================================
#pragma once
//=======================================================
// インクルード
//=======================================================
#include "Component.h"		// Component基底クラス
#include "Mesh.h"			// メッシュクラス
#include "Material.h"		// マテリアルクラス

//=======================================================
// クラス定義
//=======================================================

/// <summary>
/// メッシュレンダラー
/// </summary>
/// <remarks>
/// メッシュとマテリアルを持ち、描画を行うコンポーネント
/// </remarks>
class MeshRenderer : public Component
{
private:
	Mesh* m_mesh;
	Material* m_material;

public:

	// コンストラクタ・デストラクタ
	MeshRenderer(Mesh* mesh, Material* material);

	// 描画関数
	void Draw() override;
};
