//=======================================================
// ファイル名	: SceneSerializer.h
// 制作者		: 大槻 海斗(Sand)
// 制作日		: 2025/12/17
// 更新日		: 2025/12/17
// 詳細			: Scene を JSON 形式で保存および読み込みを行う
//=======================================================
#pragma once
//=======================================================
// インクルード
//=======================================================
#include <memory>
#include <string>

//=======================================================
// 前方宣言
//=======================================================
class Scene;

/// <summary>
/// シーンシリアライザクラス
/// </summary>
/// <remarks>
/// Scene を JSON 形式で保存および読み込みを行うクラス
/// </remarks>
class SceneSerializer
{
public:
	// シーンを指定されたパスに保存
    static bool Save(const Scene& scene, const std::string& path);
	// 指定されたパスからシーンを読み込み
    static std::shared_ptr<Scene> Load(const std::string& path);
};
